---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.IStructuralSectionsServer
source: html/95342313-8b95-6d91-689a-db114f471203.htm
---
# IStructuralSectionsServer Methods

Implement this method to return a description of the server.